# Tap
tap 'homebrew/cask'
tap 'AdoptOpenJDK/openjdk'
tap 'homebrew/cask-fonts'

# Div
brew 'coreutils'
brew 'bash-completion'
brew 'git'
brew 'bash-git-prompt'
brew 'docker-compose'
brew 'docker-machine'
brew 'z'
brew 'contacts'
brew 'speedtest-cli'
brew 'gh'
brew 'cask'
brew 'jetty'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'maven'
brew 'maven-completion'
brew 'cheat'
brew 'vim'
brew 'wget'
brew 'helm'
brew 'python'
brew 'brew-pip'
brew 'node'
brew 'npm'
brew 'openshift-cli'
brew 'exa'
brew 'kubeseal'

# Casks
cask 'docker'
cask 'slack'
cask 'google-chrome'
cask 'discord'
cask 'iterm2'
cask 'steam'
cask 'keystore-explorer'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'

# Java
cask 'adoptopenjdk8'
cask 'adoptopenjdk11'
cask 'adoptopenjdk15'
cask 'atom'
cask 'visual-studio-code'

