# Taps
tap 'azure/kubelogin'
tap 'hashicorp/tap'
tap 'mvndaemon/mvnd'
tap 'nais/tap'

# Core tools
brew 'coreutils'
brew 'git'
brew 'gh'
brew 'vim'
brew 'wget'

# Shell
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'fish'
brew 'starship'
brew 'z'
brew 'thefuck'

# Development
brew 'node'
brew 'python@3.14'
brew 'maven'
brew 'maven-completion'
brew 'gradle'
brew 'mvndaemon/mvnd/mvnd'
brew 'gemini-cli'

# Kubernetes / Cloud
brew 'kubernetes-cli'
brew 'kubectx'
brew 'kubeseal'
brew 'helm'
brew 'azure-cli'
brew 'azure/kubelogin/kubelogin'
brew 'hashicorp/tap/vault'
brew 'cloudflared'
brew 'nais/tap/nais'

# Utilities
brew 'eza'
brew 'cheat'
brew 'speedtest-cli'
brew 'mkdocs'

# Casks
cask 'ghostty'
cask 'iterm2'
cask 'visual-studio-code'
cask 'copilot-cli'
cask 'docker-desktop'
cask 'keystore-explorer'
cask 'alfred'
cask 'discord'
cask 'nais/tap/naisdevice'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'

# Java (Temurin)
cask 'temurin'
cask 'temurin@25'
cask 'temurin@21'
cask 'temurin@17'
